//*----------------------------------------------------------------*
//* HOW TO SORT USING A CARDLIB - SOME TIPS
//*----------------------------------------------------------------*
//* COMMAND TO EXECUTE THE SORT PROGRAM
//SORT       EXEC PGM=SORT
//* WHERE YOUR SYSOUT(RESULTS OF EXECUTION) HAS TO BE SHOWN
//SYSOUT     DD   SYSOUT=*
//* INPUT FILE. DISP=SHR - FILE WILL BE LOCKED DURING ITS USE
//* &MAC IS A SIMBOLIC. WORKS AS A VARIABLE AND ITS VALUES ARE
//* FILLED AT THE JCL WHICH CALLS THE JOB
//SORTIN     DD   DSN=&MAC.DISORDERED.FILE,
//           DISP=SHR
//* OUTPUT FILE. DISP=(,CATLG) MEANS DISP=(NEW,CATLG)
//* THE EXECUTION WILL CREATE A NEW FILE AND CATALOG IT
//* WE CAN KEEP IT OR DELETE IT AFTER THE EXECUTION
//* LRECL IS THE LENGTH OF THE REGISTERS IN BYTES IF IT IS FIXED
//* RECFM=FB MEANS THE LENGTH OF THE REGISTERS IS FIXED AND BLOCKED
//* IT CAN BE V-VARIABLE OR D-ASCII VARIABLE OR U-UNDEFINED
//* DSORG=PS MEANS THE FILE WILL BE PHYSICAL SEQUENTIAL
//* IT CAN BE PO-PARTITIONED OR DA-DIRECT ACCESS
//* AVGREC SET THE KIND OF MEASURE TO THE 'SPACE'. AVGREC=K MEANS KB
//* SPACE ALLOCATES THE MEMORY SIZE NEEDED TO PROCESS THE FILE
//* (REGISTER LENGTH,(HOW MANY KB,EXTENDED FOR N TIMES),RLSE)
//* RLSE MEANS THE SYSTEM RELEASES THE MEMORY AFTER ITS USE.
//SORTOUT    DD   DSN=&MAC.ORDERED.FILE,
//           DISP=(,CATLG),LRECL=180,RECFM=FB,DSORG=PS,
//           AVGREC=K,SPACE=(108,(10,10),RLSE)
//* SYSIN POINTS TO THE DIRECTORY THE CARDLIB IS AND ITS NAME
//* DISP=SHR - FILE WILL BE LOCKED DURING ITS USE
//SYSIN      DD   DSN=&ADRESS(PARAMFILE),DISP=SHR
